app/views/recipes/show.html.haml

				%ul
					- @recipe.ingredients.each do |ingredient|
---
SELECT "ingredients".* FROM "ingredients"  WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 1]]

				%ul
					- @recipe.directions.each do |direction|
---
SELECT "directions".* FROM "directions"  WHERE "directions"."recipe_id" = ?  [["recipe_id", 1]]